{
  "name": "2: The Clone Job",
  "_id": "d7S41u6UyXvsaqNP",
  "pages": [
    {
      "sort": 0,
      "name": "2: The Clone Job",
      "type": "text",
      "_id": "kgmAI49r1woNTd9O",
      "system": {},
      "title": {
        "show": false,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<div id=\"invbook\" class=\"chapter-page\"><div class=\"chapter-title float\"><div class=\"number\"><p>Chapter Two</p></div><p class=\"chapter\">The <span class=\"larger\" style=\"font-size:112px\">Clone</span> <span class=\"larger\" style=\"font-size:192px;float:left;margin-right:1rem\">Job</span></p></div><div class=\"chapter\" style=\"height:930px;margin-top:-220px\"><p style=\"margin-left:133px\"><span class=\"sans bold\">This brief introduction </span>to <span class=\"italic\">Invincible – Superhero Roleplaying</span> is the first act of <span class=\"italic\">Metro Mayhem</span>, the adventure to be concluded in the upcoming Starter Set.</p><p style=\"margin-left:133px\" class=\"indent\">In the comic series, Mark Grayson starts out as a high school student with an ordinary life, except his father Nolan is Omni-Man – the most powerful superhero on the planet. Mark eventually gains powers of his own and becomes Invincible.</p><p class=\"indent\">His world is shattered when Nolan reveals the true nature of his alien Viltrumite heritage and admits to killing the Guardians of the Globe – the world’s top super-team. After a one-sided battle with his father, Mark is brutally defeated. Omni-Man abandons Earth, leaving Mark to deal with the aftermath. The events of this adventure take place several weeks after Omni-Man leaves Earth, around the time of the formation of the new Guardians of the Globe.</p><p class=\"indent\">The adventure is intended for 3–5 players plus the <span class=\"small-caps\">GM</span> and should take just an hour or so to complete.</p><p class=\"indent\">If you are not the <span class=\"small-caps\">GM</span>, stop reading here!</p></div><img style=\"margin-top:-320px\" class=\"floatimage\" src=\"systems/invincible/assets/book/art/hq-02.webp\" /></div>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "category": null,
      "flags": {},
      "_stats": {
        "compendiumSource": "Compendium.invincible.book.JournalEntry.xT802qdP7kX518mO.JournalEntryPage.kgmAI49r1woNTd9O",
        "duplicateSource": null,
        "exportSource": null,
        "coreVersion": "13.348",
        "systemId": "invincible",
        "systemVersion": "0.0.0",
        "lastModifiedBy": "p6RpT3qDZlr0duBo",
        "modifiedTime": 1758878422941
      },
      "ownership": {
        "default": -1
      }
    },
    {
      "sort": 0,
      "name": "Prologue",
      "type": "text",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<div id=\"invbook\"><img src=\"systems/invincible/assets/book/art/inv-103-12-clip.webp\" style=\"shape-outside:url(systems/invincible/assets/book/art/inv-103-12-clip.webp);shape-margin:16px;width:60%;shape-image-threshold:0.9;margin-right:-20px;float:right\" /><p><span class=\"sans bold\">The world is still reeling</span> from the catastrophic battle between Omni-Man and Invincible, and it will likely continue to feel the effects for some time. In the midst of this chaos, nefarious forces are seizing the opportunity to further their agendas, gather resources, and lay the groundwork for their plans now that the world’s greatest superhero is gone. The need for new heroes to step up has never been greater.</p><p class=\"indent\">Two weeks ago, the Mauler twins – two hyper-intelligent criminals that don’t know which one of them is the other’s clone – escaped from Stronghold Penitentiary (again) with assistance from an unknown party. While prison personnel failed to stop their escape, the Global Defense Agency – a secret government organization responsible for safeguarding the world and overseeing the activities of super-powered individuals – tracked down the Maulers as they gathered equipment in an abandoned warehouse on the edge of the city.</p><p class=\"indent\">The crime lord Machine Head orchestrated their escape and hired them to create clones of a dangerous kaiju, or giant monster, using genetic material his organization recovered from the site of one of Omni-Man’s recent battles with the creature. Machine Head saw how much property damage was caused in the recent battle between Omni-Man and Invincible – and how much money was made during the reconstruction efforts. He plans to keep the kaiju clones as a demolition engine under his control, using them to create devastation in large cities that would require large rebuilding projects – undertaken by construction companies he secretly owns.</p><h2>Adventure Overview</h2><p>This is not a complete adventure, only the first act of one, and follows this structure:</p><ul><li><span class=\"sans bold\">Briefing:</span> Global Defense Agency Headquarters</li><li><p><span class=\"sans bold\">Act I:</span> The Clone Job</p><ul><li><span class=\"sans bold\">Action Scene 1:</span> Warehouse Lab</li><li><span class=\"sans bold\">Social Scene 1</span> (for each hero)</li></ul></li></ul><p><span class=\"italic\">Metro Mayhem</span> will be concluded in the <span class=\"italic\">Invincible – Superhero Roleplaying Starter Set.</span></p><h2>The Superheroes</h2><p>This adventure uses five pre-generated player characters, including three members of the replacement Guardians of the Globe team – Robot, Monster Girl, and Rex Splode. With the rest of the Guardians tied up with stopping a Lizard League plot in London, Cecil Stedman called in reinforcements with Atom Eve and Bulletproof.</p><p class=\"indent\">These five heroes and their character sheets are included at the back of this <span class=\"small-caps\">PDF</span>. Let the players choose which superhero they want to play. Invincible himself is also included, but players may not choose him for this brief adventure – he is only included for reference.</p><p class=\"indent\">If you have fewer than five players, the leftover superheroes become <span class=\"small-caps\">NPC</span>s under your control. If one of the <span class=\"small-caps\">PC</span>s should be seriously injured or even die during the course of the adventure, their player can take over a leftover superhero as a replacement.</p><ul><li><span class=\"sans bold\">Robot:</span> Hyper-smart intelligence housed in a high-tech robotic body. <span class=\"bold\">Role:</span> Leader</li><li><span class=\"sans bold\">Monster Girl:</span> Snarky woman in the body of a teenager due to a curse that also allows her to transform into a monstrous troll-like creature. <span class=\"bold\">Role: </span>Brawn</li><li><span class=\"sans bold\">Rex Splode:</span> Brash super-powered crime fighter with the ability to charge items with combustible particles. <span class=\"bold\">Role:</span> Blaster</li><li><span class=\"sans bold\">Atom Eve:</span> Idealistic genetically bioengineered hero with the power to manipulate matter. <span class=\"bold\">Role:</span> Controller</li><li><span class=\"sans bold\">Bulletproof:</span> Newly-operating hero able to absorb kinetic energy, granting him superhuman strength, speed, stamina, and the ability to fly. <span class=\"bold\">Role:</span> Defender</li></ul><h2>Events</h2><p>This adventure act has a section that contains events that you can spring on the heroes at any point during the action scene. These events don’t all need to occur, and they don’t need to occur in the order they’re listed. Instead, you should consider the events as a menu you can sample from to amp up the action as you see fit.</p><p class=\"indent\">Some events are mandatory, clearly indicated as such. Other events are marked as triggered, meaning a specific action on the part of the heroes triggers the event.</p><h2>Social Scenes</h2><p>After the action scene, a social scene will provide an opportunity for the heroes to roleplay interactions and recover lost Resolve. Social scenes typically take the form of a conversation between the hero and an <span class=\"small-caps\">NPC</span>, or between two of the heroes, and generally don’t use any game mechanics.</p><p class=\"indent\">Suggested social scenes for each hero are available on cards at the end of this <span class=\"small-caps\">PDF</span>. Feel free to print these out, cut them apart and hand them to the players after the action scene. Each card has two suggested scenes – one that involves another hero and one that interacts with an <span class=\"small-caps\">NPC</span>. It’s always up to the players to decide their social scenes, and they can choose to come up with their own if they prefer.</p><div class=\"box blue\"><p class=\"box-header\">Playing Social Scenes</p><p>The Invincible series includes adult situations and characters sometimes do things that are questionable or outright wrong. Players who are not comfortable with roleplaying a certain situation or want to progress through it very quickly can condense social scenes to just a brief statement, such as “I have a talk with my teacher about my poor school attendance.”</p><p class=\"indent\">Remember that this is a game, and players should not be forced to deal with topics they find distressing in real life, or that make them feel unsafe at the table. If you plan to share a social scene with another hero, always respect mutual consent between the players or a wish to skip ahead or avoid the scene entirely.</p></div></div>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "category": null,
      "flags": {},
      "_stats": {
        "compendiumSource": "Compendium.invincible.book.JournalEntry.xT802qdP7kX518mO.JournalEntryPage.kgmAI49r1woNTd9O",
        "duplicateSource": "Compendium.invincible.book.JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.kgmAI49r1woNTd9O",
        "exportSource": null,
        "coreVersion": "13.348",
        "systemId": "invincible",
        "systemVersion": "0.0.0",
        "lastModifiedBy": null
      },
      "_id": "3Rfzf3xyaSuAcgMD",
      "ownership": {
        "default": -1
      }
    },
    {
      "sort": 0,
      "name": "Briefing",
      "type": "text",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<div id=\"invbook\"><p><span class=\"sans bold\">When your players</span> have chosen their heroes, familiarized themselves with their character sheets, and asked any questions they have, read or paraphrase the text below.</p><p class=\"indent\">You are superheroes relatively new on the scene, answering a call from the Global Defense Agency – a secret organization that safeguards the world from the shadows and keeps a close watch over all superpowered activity. You’ve all had some level of contact with the GDA during your early superhero careers, but you haven’t spent much time in their secret headquarters beneath the Pentagon… until today. You've been summoned by Cecil Stedman, the elusive Director of the GDA, because he says the world needs your help in light of the catastrophic destruction caused by the recent battle between two of the world’s most powerful superheroes – Omni-Man and Invincible.</p><p class=\"indent\">After passing through intense security, you enter a spacious room with a large screen and lecture hall seating. Donald Ferguson, Cecil’s right-hand man at the GDA, finishes a quick presentation on liability agreements that need your signatures. You spot some familiar faces – heroes you've worked with or seen on the news.</p><p class=\"indent\">Donald hands out earpieces for two-way communication with the <span class=\"small-caps\">GDA</span>, cautioning you not to lose them due to how much they cost. He then tells you to “hold tight” – Cecil will join you soon for the briefing.</p><p class=\"indent\">Use this time to allow the players to introduce the hero they are playing and take part in any other initial interactions they wish to have. When you are ready to get started with the briefing, Cecil Stedman teleports into the conference room with a bright flash. Read or paraphrase the sidebar text entitled Running Short on Heroes as <span class=\"small-caps\">GDA</span> director Cecil Stedman.</p><img src=\"systems/invincible/assets/book/art/27-39.webp\" /></div>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "category": null,
      "flags": {},
      "_stats": {
        "compendiumSource": "Compendium.invincible.book.JournalEntry.xT802qdP7kX518mO.JournalEntryPage.kgmAI49r1woNTd9O",
        "duplicateSource": "Compendium.invincible.book.JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.3Rfzf3xyaSuAcgMD",
        "exportSource": null,
        "coreVersion": "13.348",
        "systemId": "invincible",
        "systemVersion": "0.0.0",
        "lastModifiedBy": "p6RpT3qDZlr0duBo",
        "modifiedTime": 1758912149058
      },
      "_id": "WZuEfQAzN0B0u4hA",
      "ownership": {
        "default": -1
      }
    },
    {
      "sort": 0,
      "name": "Into Action",
      "type": "text",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<div id=\"invbook\"><p><span class=\"sans bold\">Ready to prove themselves</span> to Cecil, the heroes travel in a GDA hovercraft, or fly alongside it, to the abandoned warehouse, giving the players time to talk with each other and get a feel for their characters. When you’re ready, the heroes arrive at the warehouse, and you can read or paraphrase the following:</p><div class=\"box blue left\"><p class=\"box-header\">Synopsis</p><p>In this act, the heroes are sent by the Global Defense Agency to investigate the warehouse laboratory of the Maulers, where they find out the twins were hired by Machine Head to clone four creatures from genetic samples the crime lord’s organization collected after one of Omni-Man’s fights with a kaiju weeks earlier. The Maulers aren’t going to go down without a fight, so the heroes must try to stop or capture them and report their findings to the GDA.</p></div><p class=\"indent\">The GDA pilot slows the hovercraft to float above the abandoned warehouse where the Mauler twins are working on their mysterious project. This part of the city is dimly lit, with most of the streetlamps long destroyed and never repaired. The building is an unremarkable rectangle, with ancient brick walls, boarded-up windows, and a tattered tin roof. A faint light filters through a rusted hole in the roof's southeastern corner, but otherwise, the place seems devoid of activity.</p><p class=\"indent\">The warehouse has a sizable hole in the roof at the southeast corner, which the Maulers have dubbed their “skylight.” While the opening isn’t large enough for the hovercraft to fit through, the heroes can disembark and enter individually through it, or they can choose to enter through another door or window.</p><p class=\"indent\">Once the heroes have entered the warehouse through any entrance, show them the area from the poster map and the @UUID[JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.A7T43HaipxEoFKXn#tripwire]{Tripwire} event begins.</p><h2>What’s Going On?</h2><p>Machine Head, the mastermind of the largest organized crime syndicate in the United States, is obsessed with gaining any advantage he can to make more money. After one of Omni-Man’s recent battles with a tentacled kaiju, his team of rogue scientists saw an opportunity and recovered the creature’s DNA, hoping to clone it. After several failed attempts, they realized they needed help and enlisted the imprisoned @UUID[JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.A7T43HaipxEoFKXn#the-mauler-twins]{The Mauler “twins”} by bribing guards to let Isotope teleport them to Machine Head’s tower.</p><p class=\"indent\">Offered freedom in exchange for their expertise, the Maulers accepted and began work at a warehouse lab on the city’s outskirts. Within weeks, together with Machine Head’s scientists they created four controllable kaiju clones – nicknamed the “Little Sluggers” by Machine Head and designated Alpha, Beta, Gamma, and Delta by the scientists. Unknown to Machine Head, the Maulers have embedded their own control overrides in case they ever need them.</p><p class=\"indent\">The clones are currently in stasis in underground containment units at various locations across the downtown area to await a field test, which would cause massive destruction to the city and would require expensive renovation efforts – contracted out to construction companies that Machine Head secretly owns.</p><p class=\"indent\">Hours before the heroes arrive, the Maulers left to gather supplies, planning to return and erase all the evidence that might reveal any of their cloning expertise. When the heroes arrive, they’ll find the locked-up scientists and cloning equipment. The Maulers will return to the warehouse shortly (see @UUID[JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.A7T43HaipxEoFKXn#honey,-were-home]{Honey, We’re Home}).</p><h2>Warehouse Features</h2><p>The warehouse is situated in a largely abandoned part of the city, and no one in the area that sees or overhears anything is inclined to intervene or call for help. Inside, everything is run-down, rusty, and filthy, except for the obviously new equipment related to the Maulers’ cloning project. Exposed wires dangle from the ceiling, walls have holes, pipes are broken, and the roof leaks.</p><p class=\"indent\"><span class=\"sans bold\">Zones:</span> The interior of the warehouse is divided into six zones – four main quadrants divided by yellow lines, the raised central platform holding the large cloning apparatus, and finally the small back office.</p><p class=\"indent\"><span class=\"sans bold\">Rooftop Hole:</span> The tin roof of the warehouse has an eight-foot-wide rusted out hole in the southeastern corner. The faint glow from computer monitors inside the warehouse seeps through the opening.</p><p class=\"indent\"><span class=\"sans bold\">Warehouse Windows:</span> The southern wall features two large multi-paned windows, occupying most of the space of the wall aside from the door. Visibility is limited, as the windows are heavily boarded up and painted over.</p><p class=\"indent\"><span class=\"sans bold\">Warehouse Doors:</span> These large metal doors are secured with a standard locking mechanism and a heavy chain fastened by multiple padlocks on the inside. The doors can be picked (<span class=\"bold serif small-caps\">AGILITY</span> roll), broken down (<span class=\"bold serif small-caps\">STRENGTH</span> roll, requiring <span class=\"bold serif small-caps\">STRENGTH</span> 5 or higher), or opened using an appropriate power (like <span class=\"bold serif small-caps\">TRANSFORMATION</span>).</p><p class=\"indent\"><span class=\"sans bold\">Experiment Supplies: </span>Metal crates and barrels line the southwestern and southeastern walls. They contain leftover materials and are potentially explosive if disturbed. If a shooting attack misses its target in either of these zones, or if a slam or knockback stunt or an area effect attack is used here, roll a D6. On a <span class=\"die-symbol ball\"> </span>, a Blast rating 4 explosion occurs.</p><div class=\"foundry-info\"><p>Use the following macro. It will roll the D6 and the explosion in case the D6 rolls a <span class=\"die-symbol ball\"> </span>.</p><p>@UUID[Macro.v4wQv8KLP46BKkye]{Experiment Supplies - Explosion}</p></div><p class=\"indent\"><span class=\"sans bold\">Food Crates:</span> Four large crates filled with pre-packaged, non-perishable food line the eastern wall of the warehouse, brought in by Machine Head’s team to keep up with the Maulers’ ferocious appetites.</p><p class=\"indent\"><span class=\"sans bold\">Tool Cabinets:</span> Two tool cabinets flank the food crates, each containing a set of general tools. An <span class=\"bold serif small-caps\">INTUITION</span> roll can reveal both the keys to the warehouse door padlocks and a sticky note with the password to the computer console (below). The password is “ChickenPotPie.”</p><p class=\"indent\"><span class=\"sans bold\">Cloning Apparatus:</span> An imposing machine looms near the center of the warehouse, perched on a raised platform with a huge, clear tank that oozes a strange green substance. Wires, pipes, indicators, and vents are visible all over it, but with its purpose fulfilled, the apparatus now lies dormant. The purpose of the machine – to produce large clones from kaiju genetic material – can be determined with a <span class=\"bold serif small-caps\">REASON</span> roll with –2 dice (the schematics in the office give +2 dice). Four automated concussion turrets (below) are mounted at the top of the central machinery, powered by the generator.</p><p class=\"indent\"><span class=\"sans bold\">Computer Console:</span> Three mega-computers are connected to the cloning apparatus. Accessing the encrypted files on the systems that reveal everything about the project requires a hard (–2) <span class=\"bold serif small-caps\">REASON</span> roll or the password from the tool cabinets. A self-destruct sequence for the apparatus can also be triggered from the console (see the @UUID[JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.A7T43HaipxEoFKXn#destroy-the-evidence]{Destroy the Evidence} event).</p><div class=\"box npc left\"><div class=\"cartoon-header\"><p>Concussion Turret</p></div><p>Poor <span class=\"sans bold small-caps\">FIGHTING </span>1 <br />Extraordinary <span class=\"sans bold small-caps\">AGILITY</span> 5 <br />Typical <span class=\"sans bold small-caps\">STRENGTH </span>2<br />No <span class=\"sans bold small-caps\">REASON </span>0<br />Great <span class=\"sans bold small-caps\">INTUITION </span>4<br />No <span class=\"sans bold small-caps\">PRESENCE </span>0</p><p class=\"health\"><span class=\"sans bold\">Health:</span> 4 <span class=\"sans bold\">Resolve:</span> –</p><p class=\"line-after\"><span class=\"sans bold small-caps\">Power source:</span> <span class=\"sans bold\">Turret mechanics.</span> Theconcussion turret was cobbled together quickly by the Maulers – it does little else than fire at intruders.</p><ul><li><span class=\"sans bold small-caps \">Major</span><span class=\"sans bold small-caps\"> BLAST:</span> Each turret can perform a shooting attack with base damage 4, range 0/4.</li><li><span class=\"sans bold small-caps\">PROTECTION:</span> Each turret has Armor 3 against all attacks. They are also immune to stress.</li><li><span class=\"sans bold small-caps\">LIMITATION:</span> The turrets cannot move, block or dodge attacks, or push dice rolls.</li></ul></div><p class=\"indent\"><span class=\"sans bold\">Power Generator:</span> Taking up half of the western wall, a heavy-duty power generator supplying electricity to the cloning apparatus and all the other electrical systems in the warehouse. Shutting down the generator requires a <span class=\"bold serif small-caps\">REASON</span> roll (full action) or smashing it – (Durability 10, Armor 2). This will power down the concussion turrets on the cloning apparatus and unlock the holding cell door but also make the computer console and holding cell intercom unusable. A <span class=\"bold serif small-caps\">REASON</span> roll can also be used to restart the generator or rig it to explode after one round (Blast 7).</p><p class=\"indent\"><span class=\"sans bold\">Holding Cell:</span> The northeast corner of the warehouse contains a holding cell where the Maulers are holding Machine Head’s four scientists. They are barely audible unless the heroes press the intercom button outside the cell. Opening the cell without the key (which the Maulers have) requires powering down the generator, the <span class=\"bold serif small-caps\">TRANSFORMATION</span> power, a <span class=\"bold serif small-caps\">REASON</span> roll, or a <span class=\"bold serif small-caps\">STRENGTH</span> roll (minimum <span class=\"bold serif small-caps\">STRENGTH</span> 5). If the heroes talk to the scientists, see the Prisoners Freed event to the right.</p><p class=\"indent\"><span class=\"sans bold\">Warehouse Office:</span> A small office is located in the northwest corner of the building. The door is unlocked. A schematic pinned to the back wall gives +2 dice to understanding the central cloning apparatus, but the room contains little else of real value – it was used by the science team to gamble on cards whenever they weren’t working.</p><p class=\"indent\"><span class=\"sans bold\">Rear Exit:</span> A standard-sized metal door on the back wall appears to be unlocked, but closer inspection reveals it has been welded shut. It cannot be opened normally, though it can be forced open with <span class=\"bold serif small-caps\">STRENGTH</span> (minimum <span class=\"bold serif small-caps\">STRENGTH</span> 5) or an appropriate power.</p><img class=\"hq no-skew\" src=\"systems/invincible/assets/book/art/fl-maulertwins-map.webp\" /><h3 class=\"hidden-header\">Challenge: Self-Destruct Sequence</h3><div class=\"box blue\"><p class=\"box-header\">Challenge: Self-Destruct Sequence</p><p>The timer is counting down – the cloning apparatus is going to blow!</p><table><thead><tr><th><p style=\"text-align:center\"><span class=\"sans bold\">Challenge Rating</span></p></th><th><p style=\"text-align:center\"><span class=\"sans bold\">Time Limit</span></p></th></tr></thead><tbody><tr><td><p style=\"text-align:center\">6</p></td><td><p style=\"text-align:center\">3 rounds</p></td></tr></tbody></table><p>If the challenge is not overcome in three rounds, a @UUID[Macro.YDcr89Ao3ZY1VbTF]{Blast 9} explosion is triggered. Suggested objectives for this challenge are provided below:</p><ul><li><span class=\"sans bold\">Destroy the Mechanism. </span>Heroes can destroy the mechanism that would trigger the explosion inside the cloning apparatus by ripping it apart (<span class=\"sans bold small-caps\">STRENGTH</span> roll, requiring <span class=\"sans bold small-caps\">STRENGTH</span> 5 or higher).</li><li><span class=\"sans bold\">Override the Encryption.</span> Heroes can bypass the encryption to try to shut down the sequence by rolling <span class=\"sans bold small-caps\">REASON</span>.</li><li><span class=\"sans bold\">Short Out the Console.</span> Heroes can overload the console to short it out by using a relevant power like <span class=\"sans bold small-caps\">BLAST</span> or <span class=\"sans bold small-caps\">MATTER CONTROL.</span> This requires an <span class=\"sans bold small-caps\">AGILITY</span> roll to aim right.</li></ul></div><h2>Events</h2><img class=\"hq no-border left\" src=\"systems/invincible/assets/book/art/invinciblecompv1-17.webp\" /><p>This section contains four events that you can spring on the heroes in Act I. They are tools that you can use to add something interesting or push the story along at a pace that works best for the group. The specific events might need to be adjusted – or removed entirely – as a result of the players’ actions. One of the events is mandatory, while two are triggered by the heroes’ actions.</p><h3 class=\"hidden-header\">Tripwire</h3><p class=\"indent\"><span class=\"sans bold\">Tripwire (Triggered):</span> The Maulers left a crude proximity-triggered intruder deterrent behind when they left for supplies. As soon as the heroes enter the warehouse through any opening or entrance, an alarm klaxon sounds, lights start flashing red from the central cloning apparatus, and four automated concussion turrets (left) rise out of the top of the central machinery and begin firing at any hero in the building. Allow each hero an <span class=\"bold serif small-caps\">INTUITION</span> roll – those who fail are surprised by the attack and get the highest (worst) initiative cards in the first round of combat. Place the cutout standees for the turrets on top of the cloning apparatus. Play out the combat until either side is defeated, or the Mauler Twins arrive (see the event @UUID[JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.A7T43HaipxEoFKXn#honey,-were-home]{Honey, We’re Home}).</p><div class=\"foundry-info\"><p>Use the following macro to activate the flashing red.</p><p>@UUID[Macro.sXBstF1WCAQiJGm1]{Tripwire}</p></div><h3 class=\"hidden-header\">Prisoners Freed</h3><p class=\"indent\"><span class=\"sans bold\">Prisoners Freed (Triggered):</span> If the heroes talk to the scientists in the holding cell, the lead scientist, Dr.Philomena Harris explains that everyone in the cell was forced to work with the Maulers against their will. She promises to share all the details about the project – who was behind it and what they created – if the heroes release them. If the scientists are released, Dr. Harris reveals the purpose of the cloning apparatus, but she does not know what Machine Head intends to use them for. An <span class=\"bold serif small-caps\">INTUITION</span> roll reveals that the doctor is telling the truth about the cloning apparatus but lying about being coerced and also hides something – that the Maulers are coming back at any minute.</p><h3 class=\"hidden-header\">Honey, We’re Home</h3><p class=\"indent\"><span class=\"sans bold\">Honey, We’re Home (Mandatory):</span> The Maulers, alerted when the proximity alarm was triggered in the Tripwire event above, return to the warehouse to get rid of both the heroes and Machine Head’s captured personnel to cover their tracks. While they were out, the twins secured some high-powered energy weapons they previously stashed in one of their storage facilities, so they decide to make a loud entrance, blasting the warehouse doors to bits. Everyone in the zones next to the doors suffers a @UUID[Macro.V2xczE7E4mGsHqRB]{Blast 6 explosion}. The doors’ scorched shards clang to the ground, and through the opening steps one Mauler with a white lab coat and another with a large bandolier strapped across his chest. Both have large rifle-like weapons in their hands and what appear to be gas masks draped around their necks. Draw initiative and see the sidebar @UUID[JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.A7T43HaipxEoFKXn#mauler-tactics]{Mauler Tactics}.</p><h3 class=\"hidden-header\">Destroy the Evidence</h3><p class=\"indent\"><span class=\"sans bold\">Destroy the Evidence:</span> If the heroes put up a good fight, one of the Maulers runs up to the computer console and enters a self-destruct code (full action). Once the code is entered, a massive Blast 9 explosion occurs after three rounds. Stopping the self-destruct sequence is a challenge – see @UUID[JournalEntry.xT802qdP7kX518mO.JournalEntryPage.rqCEkxmH0YsgTwbv]{Challenges} and the sidebar @UUID[JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.A7T43HaipxEoFKXn#challenge:-self-destruct-sequence]{Challenge: Self-Destruct Sequence}. The heroes now have to spread their efforts between fighting the Maulers and preventing the detonation!</p><div class=\"box blue\"><p class=\"box-header\">Mauler Twins Banter</p><p>The Maulers are veritable motormouths, constantly talking to the heroes and bickering amongst themselves. Suggested one-liners by situation are provided below for inspiration when running the twins.</p><p><span class=\"sans bold\">Upon entrance…</span></p><ul><li><span class=\"sans italic\">We didn’t need the door anymore – the whole place is going to burn anyway.</span></li><li><span class=\"sans italic\">No, it doesn’t matter if it’s an African or European swallow. You would be able to follow it if you weren’t the clone.</span></li><li><span class=\"sans italic\">Where are all of these superheroes coming from? Did someone figure out how to clone them?</span></li></ul><p><span class=\"sans bold\">When one of them succeeds…</span></p><ul><li><span class=\"sans italic\">This won’t take long. We’re way smarter and stronger than all of you.</span></li><li><span class=\"sans italic\">Watch and learn, clone.</span></li><li><span class=\"sans italic\">You can do that only because you’re a copy of me.</span></li></ul><p><span class=\"sans bold\">When one of them fails…</span></p><ul><li><span class=\"sans italic\">Of course a clone would have trouble with that.</span></li><li><span class=\"sans italic\">Absurd – my calculations were on point.</span></li><li><span class=\"sans italic\">Too many variables…we’re going to need to eliminate some of you.</span></li></ul><p><span class=\"sans bold\">Causing a hero to be broken…</span></p><ul><li><span class=\"sans italic\">Easily proving the original is still the best.</span></li><li><span class=\"sans italic\">Just stay down – if that didn’t do it the explosion would anyway.</span></li><li><span class=\"sans italic\">Pathetic. Even the clone won’t have any trouble with this.</span></li></ul><p><span class=\"sans bold\">Upon defeat…</span></p><ul><li><span class=\"sans italic\">It’s fine – I can always make another one.</span></li><li><span class=\"sans italic\">Not the end of the world – as long as Thursdays are still chicken pot pie day.</span></li><li><span class=\"sans italic\">We give up! We thought you were more of Machine Head’s goons – we’ll talk for immunity.</span></li></ul></div><div class=\"box blue\"><p class=\"box-header\">Finding Out About the Clones</p><p>The Maulers are ever talkative (see the Mauler Twins Banter sidebar), so when they encounter the heroes, they readily reveal that they were tasked to create the four kaiju creature clones for Machine Head in exchange for their freedom, as well as the news that the first field test for the creatures is planned to happen soon. They don’t feel the need for secrecy since they believe they’ve already secured their freedom and will walk away from all this after they deal with the heroes.their findings to the GDA.</p></div><h2 class=\"hidden-header\">The Mauler “twins”</h2><div class=\"box npc large\"><div class=\"cartoon-header\"><p>The Mauler “Twins”</p></div><p class=\"desc serif\"><span class=\"sans bold\">The Mauler “twins”</span> aren’t true twins – they're a long-running chain of clones. Because each insists he’s the original, their identity is a constant source of argument. Their origins and true motives remain unclear, but they've posed a persistent threat to superheroes for years.</p><p class=\"desc serif indent\">Most recently, the Maulers were incarcerated at Stronghold Penitentiary when they were broken out by Isotope, lieutenant to Machine Head. In exchange for their freedom, Machine Head tasked them with creating four monstrous clones using recovered kaiju DNA. They delivered, but Machine Head reneged on the deal. Now the Maulers are on the loose, looking for payback, but first they need to make sure no one is able to replicate their work.</p><p class=\"desc serif indent\">The stats below are for each Mauler.</p><p><span class=\"sans bold\">Role:</span> Brains, <span class=\"sans bold\">Occupation:</span> Criminal, <span class=\"sans bold\">Personality: </span>Sadistic, ambitious, and overconfident, with a surplus of self-preservation instinct. <span class=\"sans bold\">Drive: </span>Discovery. The hunt for knowledge results in more power. <span class=\"sans bold\">Flaw: </span>Short-sighted. TheMauler Twins never consider the long-term implications.</p><p class=\"health\"><span class=\"sans bold\">Reputation:</span> 3 <span class=\"sans bold\">Resources:</span> 4</p><p>Astounding <span class=\"sans bold small-caps\">FIGHTING</span> 8, Incredible <span class=\"sans bold small-caps\">AGILITY</span> 6, Amazing <span class=\"sans bold small-caps\">STRENGTH</span> 7, Astounding <span class=\"sans bold small-caps\">REASON</span> 8, Good <span class=\"sans bold small-caps\">INTUITION</span> 3, Great <span class=\"sans bold small-caps\">PRESENCE</span> 4</p><p class=\"health\"><span class=\"sans bold\">Health:</span> 17 <span class=\"sans bold\">Resolve:</span> 8 <span class=\"sans bold\">Base Slugfest Damage:</span> 4</p><p class=\"line-after\"><span class=\"sans bold small-caps\">Power source:</span> <span class=\"sans bold\">High-tech inventions.</span> TheMaulers extensively utilize technology to further their endeavors, such as energy weapons, neurotoxin darts, nano-tasers, and sensor equipment.</p><ul><li><span class=\"sans bold small-caps\">AFFLICTION</span><span class=\"sans bold\"> (debilitating ray):</span> Ashooting attack with base damage 3, range 0/1. The attack does not inflict any actual damage – instead, if it penetrates any armor, the target suffers –3 dice to all attribute rolls until a <span class=\"sans bold small-caps\">PRESENCE</span> roll (with the penalty) is made to shake off the effect. The <span class=\"sans bold small-caps\">PRESENCE</span> roll is no action, but only one attempt can be made per round and only on the victim’s own turn.</li><li><span class=\"sans bold small-caps\">Massive BLAST</span><span class=\"sans bold\"> (energy weapon):</span> AMauler Twin can perform a shooting attack withbase damage 5, range 0/5.</li><li><span class=\"sans bold small-caps\">DETECTION</span><span class=\"sans bold\"> (sensor gear):</span> A Mauler can automatically sense the presence of invisible energies in their zone. Examples include magnetic fields, radiation, psionics, shadowforce, astral energies, and magic. As a quick action, they can roll <span class=\"sans bold small-caps\">INTUITION</span> to sense the presence of such energies within 3 zones.</li><li><p><span class=\"sans bold small-caps\">DISTRESS</span> <span class=\"sans bold\">(neurotoxin darts):</span> A shooting attack with base damage 3, range 0/3. If the attack pierces any armor, it inflicts stress instead of damage. Extra <span class=\"die-symbol tag\"> </span> rolled increase thestress inflicted normally.</p></li><li><span class=\"sans bold small-caps\">STUN</span> <span class=\"sans bold\">(nano-taser):</span> A shooting attack with base damage 3, range 0/3. The attack does not inflict any actual damage – instead, if it penetrates any armor, the target must make an immediate <span class=\"sans bold small-caps\">PRESENCE</span> roll (no action) or miss their next turn. They also cannot perform interrupt actions until then.</li></ul><p class=\"line-after\"><span class=\"sans bold small-caps\">Power source:</span> <span class=\"sans bold\">Genetically altered physiology.</span> TheMaulers have heightened physical capabilities through a series of cloned iterations.</p><ul><li><span class=\"sans bold small-caps\">PROTECTION:</span> Each Mauler has Armor 2 against all attacks.</li><li><span class=\"sans bold small-caps\">QUICKNESS: </span>Once per round, a Mauler can gain an extra action (quick or full) by taking 1 point of stress, ontheir turn or as an interrupt action.</li></ul><p class=\"line-after\"><span class=\"sans bold\">Talents</span></p><ul><li><span class=\"sans bold small-caps\">Cunning:</span> The Maulers can push any <span class=\"sans bold small-caps\">REASON</span> roll twice. Each push still inflicts 1 point of stress.</li><li><span class=\"sans bold small-caps\">Durable </span><span class=\"sans bold small-caps \">×</span><span class=\"sans bold small-caps\"> 3</span> (accounted for): The Maulers’ maximum Health scores are increased by 6.</li><li><p><span class=\"sans bold small-caps\">Find Weakness: </span>When a Mauler rolls extra</p><p><span class=\"die-symbol tag\"> </span> in a slugfest attack, he can spend one <span class=\"die-symbol tag\"> </span> to eliminate the effect of any armor.</p><p></p></li><li><span class=\"sans bold small-caps\">Merciless: </span>The Maulers regain 1 point of Resolve each time they cause an enemy to be broken by damage.</li></ul><p class=\"line-after\"><span class=\"sans bold\">Drawbacks</span></p><ul><li><span class=\"sans bold small-caps\">Gear Dependent: </span>If the Maulers’ high-tech inventions are lost, neutralized, destroyed, or otherwise rendered non-operational, they lose access to all of their powers. Their attributes are not affected.</li></ul><img src=\"systems/invincible/assets/book/art/invincible-maulertwins.webp\" /></div><h3 class=\"hidden-header\">Mauler Tactics</h3><div class=\"box blue\"><p class=\"box-header\">Mauler Tactics</p><p>The Maulers weren’t expecting visitors when the warehouse’s proximity alarm went off. Still, they're too protective of their cloning “intellectual property” to leave anything behind. They had already planned to return to destroy the lab and eliminate the science team who had learned too much – now the heroes are just one more loose end to tie up.</p><p class=\"indent\">Though they are super-geniuses, the Maulers often lack common sense. They can quickly assess threats and form a tactical plan, but their tendency to bicker and their difficulty improvising may cause slip-ups during the fight.</p><p class=\"indent\"><span class=\"sans bold\">Blast &amp; Charge:</span> The Maulers start the fight by targeting the most physically resilient heroes with energy rifle blasts (<span class=\"sans bold small-caps\">BLAST</span>), then rushing weaker-looking heroes in close combat. They’ll use their <span class=\"sans bold small-caps\">DISTRESS</span> and <span class=\"sans bold small-caps\">STUN</span> powers against heroes with lower <span class=\"sans bold small-caps\">PRESENCE</span> scores, like Bulletproof and Robot.</p><p class=\"indent\"><span class=\"sans bold\">Balancing the Fight: </span>The Maulers’ use their <span class=\"sans bold small-caps\">QUICKNESS</span> to even out the fact that they are outnumbered. Don’t overuse this power if the heroes are having a hard time, however.</p><p class=\"indent\"><span class=\"sans bold\">Fight or Flight:</span> The Maulers prioritize survival over proving something with the heroes. If either drops below half Health or Resolve, they will attempt to escape, but not before triggering the @UUID[JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.A7T43HaipxEoFKXn#destroy-the-evidence]{Destroy the Evidence} event.</p></div><h2>Social Scenes</h2><p>Once the heroes inform Cecil of what the Maulers were up to and the impending kaiju field test, he tells them to stand down until he calls on them again, signaling it is time for a social scene. As Cecil Stedman’s voice comes through the heroes’ earpieces, read or paraphrase the boxed text entitled Standing Down.</p><p class=\"indent\">Next, hand the players the cards with their suggested social scenes and let them decide which option they want to play and where it should take place. The players are also free to come up with their own social scenes. The heroes will have a few hours before Cecil calls on them again, so they can return to their civilian lives or their superhero base, whichever they prefer. The Guardians of the Globe have established a temporary base hidden in the top of a suspension bridge that Robot, Rex Splode, and Atom Eve once used when they were part of the Teen Team.</p><p class=\"indent\">After a hero’s social scene is completed, they recover all lost Resolve. For more on playing social scenes, see @UUID[JournalEntry.xT802qdP7kX518mO.JournalEntryPage.AerTh9HkdJIGEOGm#scenes]{Scenes}.</p></div>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "category": null,
      "flags": {},
      "_stats": {
        "compendiumSource": "Compendium.invincible.book.JournalEntry.xT802qdP7kX518mO.JournalEntryPage.kgmAI49r1woNTd9O",
        "duplicateSource": "Compendium.invincible.book.JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.WZuEfQAzN0B0u4hA",
        "exportSource": null,
        "coreVersion": "13.348",
        "systemId": "invincible",
        "systemVersion": "0.0.0",
        "lastModifiedBy": "p6RpT3qDZlr0duBo",
        "modifiedTime": 1758926640963
      },
      "_id": "A7T43HaipxEoFKXn",
      "ownership": {
        "default": -1
      }
    },
    {
      "sort": 0,
      "name": "Act II: Cliffhanger",
      "type": "text",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<div id=\"invbook\"><p><span class=\"sans bold\">After each hero</span> participates in their social scene, Cecil contacts the heroes simultaneously through their earpieces with direction. Read or paraphrase the sidebar entitled Machine Head’s Tower.</p><p class=\"indent\">Machine Head’s downtown tower doesn’t take long to reach, as the GDA sends the hovercraft back to escort the heroes to their destination. Read or paraphrase the following:</p><p class=\"indent quote\"><span>The sun breaks through a gap in the passing clouds, casting a bright reflection off the many windows of your destination – one of the city’s tallest skyscrapers, headquarters to Machine Head’s global criminal syndicate. A few large, hovering drones patrol the airspace around the tower, while two dozen guards are stationed outside the tower’s front entrance. It’s clear that Machine Head knows you’re coming, but the low rumble that just started booming out from the roof reminds you that the field test could begin at any moment…</span></p><p>That’s it! The <span class=\"italic\">Metro Mayhem</span> adventure will be concluded in the <span class=\"italic\">Invincible – Superhero Roleplaying Starter Set.</span></p><img src=\"systems/invincible/assets/book/art/dude.webp\" /></div>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "category": null,
      "flags": {},
      "_stats": {
        "compendiumSource": "Compendium.invincible.book.JournalEntry.xT802qdP7kX518mO.JournalEntryPage.kgmAI49r1woNTd9O",
        "duplicateSource": "Compendium.invincible.book.JournalEntry.d7S41u6UyXvsaqNP.JournalEntryPage.A7T43HaipxEoFKXn",
        "exportSource": null,
        "coreVersion": "13.348",
        "systemId": "invincible",
        "systemVersion": "0.0.0",
        "lastModifiedBy": null
      },
      "_id": "Rtd5QTO53VQ87BYy",
      "ownership": {
        "default": -1
      }
    }
  ],
  "folder": "qurtK6NXUZ1CuYEE",
  "categories": [],
  "flags": {},
  "_stats": {
    "compendiumSource": "Compendium.invincible.book.JournalEntry.d7S41u6UyXvsaqNP",
    "duplicateSource": null,
    "exportSource": null,
    "coreVersion": "13.348",
    "systemId": "invincible",
    "systemVersion": "0.0.0",
    "createdTime": 1758876358389,
    "modifiedTime": 1758924110464,
    "lastModifiedBy": "p6RpT3qDZlr0duBo"
  },
  "sort": 300000,
  "ownership": {
    "default": 0
  }
}
